'''
3. Пользователь вводит месяц в виде целого числа от 1 до 12.
Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
Напишите решения через list и через dict.
'''
seasons = {
    1: "зима",
    2: "зима",
    3: "весна",
    4: "весна",
    5: "весна",
    6: "лето",
    7: "лето",
    8: "лето",
    9: "осень",
    10: "осень",
    11: "осень",
    12: "зима",
}
while True:
    try:
        user_answer = int(input("Введите месяц в виде целого числа от 1 до 12: "))
        if user_answer > 12 or user_answer < 1:
            print("Такого месяца не существует, попробуйте еще раз")
            continue
    except ValueError as err:
        print("Это не число, попробуйте еше раз")
    else:
        break

print(f"{user_answer} месяц относится к времени года: {seasons.get(user_answer)}")
